# Girls Who Code - Python Series
## Pandas
## Mentor - Amir ElTabakh

Pandas is a Python library used for data manipulation and analysis. It's name is a play on "Python Data Analysis", and was published as an open source library in 2009 by Wes McKinney. 

#### Agenda
- Installing Python packages on your machine
- Data Exploration
- Data Cleaning
- Data Visualizations

Pandas does not come with the standard Python library, as Python is open source and developers are creating new libraries all the time. To install Pandas on our machine we will pip install it. pip is the standard package manager for Python, it allows you to install and manage additional packages. The Python installer installs pip, so it should be ready for use. Verify that pip is installed by running the following command

In [1]:
!pip --version

pip 21.2.4 from E:\Users\amira\anaconda\lib\site-packages\pip (python 3.8)

Now let's pip install pandas with the following command. Note when using a Notebook, such as this one on Jupyter, we can run shell commands by starting a line with an exclamation mark.

In [2]:
!pip install pandas

Requirement already satisfied: pandas in e:\users\amira\anaconda\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in e:\users\amira\anaconda\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in e:\users\amira\anaconda\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.7.3 in e:\users\amira\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in e:\users\amira\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: Ignoring invalid distribution -ip (e:\users\amira\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (e:\users\amira\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (e:\users\amira\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (e:\users\amira\anaconda\lib\site-packages)

Now that we've installed Pandas, lets import the library. Note that we only have to install a library once per machine, but we have to import it in every program we wish to use the library in.

In [3]:
import pandas as pd

Pandas is the most common library for data analytics, and data wrangling. Thankfully theres a lot of documentation.

https://pandas.pydata.org/pandas-docs/stable/user_guide/index.html#user-guide


Excel files are commonly saved as either a `.csv` or `.xlsx` files. CSV stands for Comma Seperated Values, its a plain text file that contains a list of data. XLSX files are files used in Microsoft Excel, a spreadsheet application that uses tables to organize, analyze, and store data. Microsoft Excel encourages saving your file as an `.xlsx` file.

We will be importing CSV files in our workshop, the code to import a CSV file is different from the code to import an XLSX file. To import an XLSX file run this code.

`variable_name = pd.read_excel("Resources/file_name.xlsx", sheet_name="optional")`

In [9]:
# Importing CSVs
school_data_df = pd.read_csv("Resources/schools_complete.csv")
student_data_df = pd.read_csv("Resources/students_complete.csv")

## Data Exploration

In [25]:
school_data_df.head(-1)

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916

In [22]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [35]:
student_data_df[["reading_score", "math_score"]].describe()

       reading_score    math_score
count    39170.00000  39170.000000
mean        81.87784     78.985371
std         10.23958     12.309968
min         63.00000     55.000000
25%         73.00000     69.000000
50%         82.00000     79.000000
75%         91.00000     89.000000
max         99.00000     99.000000

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html?highlight=describe#pandas.DataFrame.describe

This is the documentation for the describe method.
```
Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.
```
We've gotten a high level overview of the reading and the math scores, but what is the average of the two scores?

In [39]:
reading_score_mean = student_data_df["reading_score"].mean()
math_score_mean = student_data_df["math_score"].mean()
total_mean = (reading_score_mean + math_score_mean) / 2

print(f"Reading Score Mean: {round(reading_score_mean, 2)}")
print(f"Math Score Mean: {round(math_score_mean, 2)}")
print(f"Average Score: {round(total_mean, 2)}")

Reading Score Mean: 81.88
Math Score Mean: 78.99
Average Score: 80.43

## Data Cleaning
### Checking for missing data

Lets take a look at the first 5 rows of each dataframe.

In [15]:
# To get the total number of empty rows, or rows that are "True", we can use the Pandas ".sum()" method
# after the ".isnull()" method.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [16]:
# To get the total number of empty rows, or rows that are "True", we can use the Pandas ".sum()" method
# after the ".isnull()" method.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [17]:
# The ".notnull()" method returns the opposite boolean value of an ".isnull()" method
student_data_df.notnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...
39165,True,True,True,True,True,True,True
39166,True,True,True,True,True,True,True
39167,True,True,True,True,True,True,True
39168,True,True,True,True,True,True,True
39169,True,True,True,True,True,True,True

In [18]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

Thankfully there are no null values in our student_df dataframe, so that saves us some time. There are multiple approaches to dealing with missing data. Lets import a dataset and practice how we would deal with missing data.

In [42]:
# Importing missing_grades dataset
missing_grades_df = pd.read_csv("Resources/missing_grades.csv")
missing_grades_df.head()

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0         NaN
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0

In [43]:
missing_grades_df.describe()

       Student ID  reading_score  math_score
count  307.000000     293.000000  286.000000
mean   153.000000      80.907850   75.468531
std     88.767487      10.767867   12.652885
min      0.000000      63.000000   55.000000
25%     76.500000      72.000000   65.000000
50%    153.000000      81.000000   76.000000
75%    229.500000      90.000000   86.000000
max    306.000000      99.000000   99.000000

In [44]:
# Checking to see if there are any missing values
missing_grades_df.isnull().sum()

Student ID        0
student_name      0
gender            0
grade             0
reading_score    14
math_score       21
dtype: int64

We have missing data points in the `reading_score` and the `math_score` columns. If we do nothing, when we sum or take the averages of the reading and math scores, those NaNs will not be considered. However if we multiply or divide with a row that has a NaN, the answer will be NaN. This may cause problems.

There are two simple approaches to dealing with the missing data.

- Drop the rows where there are NaNs. This can cause problems later if there is data in the other rows that we need. Before dropping rows with NaN, you should ask yourself how much data would be removed if NaNs are dropped, and how it would impact analysis.
```
# Drop the NaNs
missing_grade_df.dropna()
```
- We can choose to fill in the row. Filling in an empty row must be used with caution, adding irrelevant data may impact arithmetic calculations.
```
# Fill in the empty rows with 85.
missing_grade_df.fillna(85)
```
There are so many ways to deal with missing data, find one that works for your needs.

In [49]:
# Drop the NaNs
missing_grades_df_dropped_NA = missing_grades_df.dropna()
print(f"Row Count: {missing_grades_df_dropped_NA.count()}\n")

missing_grades_df_dropped_NA.describe()

Row Count: Student ID       272
student_name     272
gender           272
grade            272
reading_score    272
math_score       272
dtype: int64

       Student ID  reading_score  math_score
count  272.000000     272.000000  272.000000
mean   153.735294      80.713235   75.191176
std     87.708149      10.810619   12.536892
min      0.000000      63.000000   55.000000
25%     79.750000      71.000000   65.000000
50%    153.500000      81.000000   75.000000
75%    226.250000      89.250000   85.250000
max    306.000000      99.000000   99.000000

In [50]:
# Putting this here to compare the two summary statistics
student_data_df[["reading_score", "math_score"]].describe()

       reading_score    math_score
count    39170.00000  39170.000000
mean        81.87784     78.985371
std         10.23958     12.309968
min         63.00000     55.000000
25%         73.00000     69.000000
50%         82.00000     79.000000
75%         91.00000     89.000000
max         99.00000     99.000000

In [51]:
# Fill in the empty rows with 85.
missing_grades_df_85 = missing_grades_df.fillna(85)
print(f"Row Count: {missing_grades_df_85.count()}\n")

missing_grades_df_85.describe()

Row Count: Student ID       307
student_name     307
gender           307
grade            307
reading_score    307
math_score       307
dtype: int64

       Student ID  reading_score  math_score
count  307.000000     307.000000  307.000000
mean   153.000000      81.094463   76.120521
std     88.767487      10.553360   12.446558
min      0.000000      63.000000   55.000000
25%     76.500000      73.000000   66.000000
50%    153.000000      82.000000   77.000000
75%    229.500000      89.000000   85.000000
max    306.000000      99.000000   99.000000

### Cleaning Student Names

Some names have prefixes. Row 4 has a student with the prefix 'Dr.'. Lets remove all of the prefixes.

In [19]:
# Outputting the column vector `student_name`.
student_data_df["student_name"]

0             Paul Bradley
1             Victor Smith
2          Kevin Rodriguez
3        Dr. Richard Scott
4               Bonnie Ray
               ...
39165         Donna Howard
39166            Dawn Bell
39167       Rebecca Tanner
39168         Desiree Kidd
39169      Carolyn Jackson
Name: student_name, Length: 39170, dtype: object

In [20]:
student_names = student_data_df["student_name"].tolist()
student_names[0:10]

['Paul Bradley',
 'Victor Smith',
 'Kevin Rodriguez',
 'Dr. Richard Scott',
 'Bonnie Ray',
 'Bryan Miranda',
 'Sheena Carter',
 'Nicole Baker',
 'Michael Roth',
 'Matthew Greene']